#!/usr/bin/python3
# -*- coding:utf-8 -*-
name = "任贤齐"
age = 45.7688
"""输出：我想听45岁的任贤齐唱歌"""

# 写法1：格式化输出
print("1我想听%d岁的%s唱歌" % (age, name))  # 使用占位符%，常见的表示方法，比如：%d表示十进制数，%s表示字符串，%f表示浮点型
print("2我想听%.2f岁的%s唱歌" % (age, name))  # %.2f，表示浮点数取小数点后两位有效数字，多个变量注意顺序
print("3我想听%.1f岁的%s唱歌" % (age, name))  # %.1f，表示浮点数取小数点后1位有效数字，四舍五入，不加的话默认保留6位有效数字
print("4我想听%s岁的%s唱歌" % (age, name))  # %s填充的值如果不是字符串，会默认进行数据类型转换再进行填充

# 写法2
print("5我想听{}岁的{}唱歌".format(age, name))

# 写法3
print(f"6我想听{age}岁的{name}唱歌")

# 写法4：拼接，字符串拼接注意数据类型的统一
print("7我想听" + str(age) + "岁的" + name + "唱歌")
